Lecture_notes/Lecture_8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-11 Wed 15:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The logistic regression</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros-Chávez" />
</head>
<body>
<div id="content">
<h1 class="title">The logistic regression</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01ce52d">1. Introduction</a></li>
<li><a href="#orgb0f3521">2. Classification and the difficulties with linear regression approach</a></li>
<li><a href="#org52dcb91">3. Binary case</a></li>
<li><a href="#org0114a5f">4. The logistic model</a></li>
<li><a href="#orgd8a3ff7">5. Some properties of the logistic equation</a></li>
<li><a href="#orgf4608ca">6. Odds and logit</a></li>
<li><a href="#orgdbfeb65">7. Estimating the Regression Coeﬃcients</a></li>
<li><a href="#orgb66a1cc">8. Log likelihood for the logistic regression</a></li>
<li><a href="#org32ff803">9. Critical points</a></li>
<li><a href="#orgb02da54">10. Multiple Logistic Regression</a></li>
<li><a href="#orgd90f6b5">11. Logistic Regression with More Than Two Classes</a></li>
<li><a href="#orgc7c25a4">12. The glm in R</a></li>
<li><a href="#orge1fba8e">13. Summary</a></li>
<li><a href="#orga658d83">14. The example in R</a></li>
<li><a href="#org1252452">15. Example (simulation)</a></li>
<li><a href="#org4958166">16. The glm function</a></li>
<li><a href="#org32e19af">17. Null and Residual deviance.</a></li>
<li><a href="#org74e1614">18. Predictions</a></li>
<li><a href="#org9b636fc">19. Assess the model: Confusion matrix and Accuracy</a></li>
<li><a href="#org6db8e69">20. Interpretation of the coefficients</a></li>
<li><a href="#org8296cb2">21. Intercept</a></li>
<li><a href="#orgf8f8cd0">22. Logistic regression with one explanatory variable being categorical.</a></li>
<li><a href="#org86e3b59">23. Confidence intervals</a></li>
<li><a href="#org662f880">24. K-nearest neighbourhood</a>
<ul>
<li><a href="#org2a7b79f">24.1. Logistic Regression for more than two Response Classes</a></li>
<li><a href="#orge8adacd">24.2. Normalisation function</a></li>
<li><a href="#orgda6f8c5">24.3. Example: Iris.</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org01ce52d" class="outline-2">
<h2 id="org01ce52d"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The linear regression model discussed in previous lectures assumes that the response variable \(Y\) is quantitative. But in many situations, the response
variable is instead qualitative.
</p>

<p>
Often qualitative variables are referred to as <i>categorical</i>.
</p>

<p>
Then, the problem of predicting in this case is a problem of <b>classification</b>.
</p>
</div>
</div>
