Lecture_notes/Lecture_8.org
* Classification and the difficulties with linear regression approach

Some difficulties arise when we try to use a simple linear regression model in 
order to classify some data into some categories.

In the best scenario, the response variable’s values take on a natural ordering, such as
mild, moderate, and severe, and hopefully we also have that the gap between mild and moderate
is similar to the gap between moderate and severe, then a 1, 2, 3 coding
would be reasonable. 

Unfortunately, in general there is no natural way to
convert a qualitative response variable with more than two levels into a
quantitative response that is ready for linear regression.


For a binary (two level) qualitative response, the situation is better. It does not matter
if we flip the coding we use for the values of the $Y$ -variable, the linear regression will
produce the same predictors.


* Binary case

For a binary response with a 0/1 coding as above, regression by least
squares does make sense; it can be shown that the estimate $\hat{\beta}X$ obtained using linear
regression is in fact an estimate of $Pr( Y=y |X)$ in this special
case. However, if we use linear regression, some of our estimates might be
outside the [0, 1] interval, making them hard to interpret
as probabilities.

Another limitation is that this approach cannot be easily extended to
accommodate qualitative responses with more than two levels.

*  The logistic model

We would like a model that predicts the relationship between $Pr(Y=1|X)$ and $X$.

The logistic function $p:\mathbb{R}\to [0,1]$ is given by
\begin{equation}
p(X) = \frac{ e^{\beta_0 + \beta_1 X}}{1 + e^{\beta_0 + \beta_1 X}}.
\end{equation}


Or equivalently

\begin{equation}
\frac{p(X)}{1-p(X)} = e^{\beta_0 + \beta_1 X}.	
\end{equation}


* Some properties of the logistic equation

The differential equation $x' = ax$ can be considered as a simplistic model of
population growth when $a > 0$. The quantity $x(t)$ measures the population
of some species at time $t$. 

The assumption that leads to the differential equation is that the rate of growth of the population (namely, $dx/dt$) is directly
proportional to the size of the population. 

Of course, this naive assumption omits many circumstances that govern actual population growth, including,
for example, the fact that actual populations cannot increase without bound.


To take this restriction into account, we can make the following further
assumptions about the population model:

1. If the population is small, the growth rate remains directly proportional to the size of the population.
2. If the population grows too large, however, the growth rate becomes negative.

One differential equation that satisfies these assumptions is the logistic population growth model. This differential equation is

\begin{equation}
x' = ax \left(1 - \frac{x}{N}\right),
\end{equation}

or the simplified version when $N=1$ given by

\begin{equation}
x' = ax \left(1 - x\right).
\end{equation}

One can show that the solution of this ODE has the form of the logistic function $p(X)$.

* Odds and logit

The quantity

\begin{equation}
\frac{p(X)}{1-p(X)},
\end{equation}
is called the /odds/.

Its logarithm is called /log-odds/ or simply /logit/:
\begin{equation}
\ln\left(\frac{p(X)}{1-p(X)}\right).
\end{equation}


Then, the /logistic/ regression model has a /linear/ logit in the variable $X$.


* Estimating the Regression Coeﬃcients

The coefficients are estimated by the method of maximum likelihood. 

Recall

Let $X_1, X_2, X_3, \ldots, X_n$ be a random sample from a distribution with a parameter 
$\theta$ (In general, $\theta$ might be a vector, $\theta=(\theta_1,\theta_2,\ldots, \theta_k)$.) 

Suppose that $x_1, x_2, \ldots, x_n$ are the observed values of $X_1, X_2,\ldots , X_n$. 

We define the likelihood function as the probability of the observed sample as a function of $\theta$:

\begin{equation}
L(x_1,\ldots, x_n ; \theta ) = P(X_1 = x_1, X_2 = x_2, \ldots, X_n = x_n; \theta )
\end{equation}

A maximum likelihood estimate of $\theta$, is a value that maximises the likelihood function.


In the case of the logistic regression we have two vectors:
+ A vector of features $x_i$ 's .
+ A vector of observed classes $y_i$ 's.

And the associated probabilities:
+ A probability $p$ of one class if $y_i = 1$.
+ A probability $1-p$ of the other class if $y_i = 0$.

Then the likelihood function (in two variables) is given by

\begin{equation}
\displaystyle L(\beta_0,\beta_1) = \prod_{i=1}^{n} p(x_i)^{y_i}\left( 1- p(x_i) \right)^{1-y_i}.
\end{equation}

* Log likelihood for the logistic regression

\begin{equation}
\begin{split}
\ln(L) & = \sum_{i=1}^{n} y_i\left( \ln(p(x_i) \right) + \left(1-y_i\right)\ln\left(1 - p(x_i)\right)\\
& = \sum_{i=1}^{n}\ln\left(1 - p(x_i)\right) + \sum_{i=1}^{n} y_i \ln\left(\frac{p(x_i)}{1-p(x_i)}\right)\\
& = \sum_{i=1}^{n}\ln\left(\frac{1}{1 + e^{\beta_0 + \beta_1 x_i}}\right) + \sum_{i=1}^{n} y_i \left(\beta_0 + \beta_1 x_i\right)\\
& = - \sum_{i=1}^{n}\ln\left(1 + e^{\beta_0 + \beta_1 x_i}\right) + \sum_{i=1}^{n} y_i \left(\beta_0 + \beta_1 x_i\right).
\end{split}
\end{equation}

* Critical points

Then we have to solve the equations

\begin{equation}
\begin{split}
\frac{\partial \ln(L)}{\partial \beta_0} &= - \sum_{i=1}^{n} \frac{e^{\beta_0 + \beta_1 x_i}}{1 + e^{\beta_0 + \beta_1 x_i}} + \sum_{i=1}^{n} y_i \\
&= \sum_{i=1}^{n} (y_i-p(x_i) )= 0, \\
\frac{\partial \ln(L)}{\partial \beta_1} &= - \sum_{i=1}^{n} \frac{e^{\beta_0 + \beta_1 x_i}}{1 + e^{\beta_0 + \beta_1 x_i}} x_i + \sum_{i=1}^{n} y_ix_i\\
&= \sum_{i=1}^{n} (y_i-p(x_i))x_i = 0. \\
\end{split}
\end{equation}

Solutions to this system of equations are obtained using numerical methods.

* Multiple Logistic Regression

We now consider the problem of predicting a binary response using multiple
predictors. By analogy with the extension from simple to multiple linear
regression, we can generalise as follows: If $X = (X_1, \ldots, X_p)$ are $p$ predictor variables
then

\begin{equation}
p(X) = \frac{ e^{\beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p}}{ 1 + e^{\beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p}},
\end{equation}

since 

\begin{equation}
\ln\left(\frac{p(X)}{1-p(X)}\right)= \beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p.
\end{equation}


* Logistic Regression with More Than Two Classes

If $Y$ can take on more than two values, say $k$ of them, we can still use logistic regression. Then each class 
$c$ in $0:(k-1)$, will have its own set of parameter $\beta_0^{(c)}$ and $\beta_1^{(c)}$, and predicted probabilities
\begin{equation}
\displaystyle \mbox{Pr}(Y = c | X = x) = \frac{e^{\beta_0^{(c)} + \beta_1^{(c)}x}}{\sum_{j=0}^{k-1} e^{\beta_0^{(j)} + \beta_1^{(j)}x}}
\end{equation}


