Lecture_notes/Lecture_8.html

<div id="outline-container-orgb0f3521" class="outline-2">
<h2 id="orgb0f3521"><span class="section-number-2">2</span> Classification and the difficulties with linear regression approach</h2>
<div class="outline-text-2" id="text-2">
<p>
Some difficulties arise when we try to use a simple linear regression model in 
order to classify some data into some categories.
</p>

<p>
In the best scenario, the response variable’s values take on a natural ordering, such as
mild, moderate, and severe, and hopefully we also have that the gap between mild and moderate
is similar to the gap between moderate and severe, then a 1, 2, 3 coding
would be reasonable. 
</p>

<p>
Unfortunately, in general there is no natural way to
convert a qualitative response variable with more than two levels into a
quantitative response that is ready for linear regression.
</p>


<p>
For a binary (two level) qualitative response, the situation is better. It does not matter
if we flip the coding we use for the values of the \(Y\) -variable, the linear regression will
produce the same predictors.
</p>
</div>
</div>


<div id="outline-container-org52dcb91" class="outline-2">
<h2 id="org52dcb91"><span class="section-number-2">3</span> Binary case</h2>
<div class="outline-text-2" id="text-3">
<p>
For a binary response with a 0/1 coding as above, regression by least
squares does make sense; it can be shown that the estimate \(\hat{\beta}X\) obtained using linear
regression is in fact an estimate of \(Pr( Y=y |X)\) in this special
case. However, if we use linear regression, some of our estimates might be
outside the [0, 1] interval, making them hard to interpret
as probabilities.
</p>

<p>
Another limitation is that this approach cannot be easily extended to
accommodate qualitative responses with more than two levels.
</p>
</div>
</div>

<div id="outline-container-org0114a5f" class="outline-2">
<h2 id="org0114a5f"><span class="section-number-2">4</span> The logistic model</h2>
<div class="outline-text-2" id="text-4">
<p>
We would like a model that predicts the relationship between \(Pr(Y=1|X)\) and \(X\).
</p>

<p>
The logistic function \(p:\mathbb{R}\to [0,1]\) is given by
</p>
\begin{equation}
p(X) = \frac{ e^{\beta_0 + \beta_1 X}}{1 + e^{\beta_0 + \beta_1 X}}.
\end{equation}


<p>
Or equivalently
</p>

\begin{equation}
\frac{p(X)}{1-p(X)} = e^{\beta_0 + \beta_1 X}.	
\end{equation}
</div>
</div>


<div id="outline-container-orgd8a3ff7" class="outline-2">
<h2 id="orgd8a3ff7"><span class="section-number-2">5</span> Some properties of the logistic equation</h2>
<div class="outline-text-2" id="text-5">
<p>
The differential equation \(x' = ax\) can be considered as a simplistic model of
population growth when \(a > 0\). The quantity \(x(t)\) measures the population
of some species at time \(t\). 
</p>

<p>
The assumption that leads to the differential equation is that the rate of growth of the population (namely, \(dx/dt\)) is directly
proportional to the size of the population. 
</p>

<p>
Of course, this naive assumption omits many circumstances that govern actual population growth, including,
for example, the fact that actual populations cannot increase without bound.
</p>


<p>
To take this restriction into account, we can make the following further
assumptions about the population model:
</p>

<ol class="org-ol">
<li>If the population is small, the growth rate remains directly proportional to the size of the population.</li>
<li>If the population grows too large, however, the growth rate becomes negative.</li>
</ol>

<p>
One differential equation that satisfies these assumptions is the logistic population growth model. This differential equation is
</p>

\begin{equation}
x' = ax \left(1 - \frac{x}{N}\right),
\end{equation}

<p>
or the simplified version when \(N=1\) given by
</p>

\begin{equation}
x' = ax \left(1 - x\right).
\end{equation}

<p>
One can show that the solution of this ODE has the form of the logistic function \(p(X)\).
</p>
</div>
</div>

<div id="outline-container-orgf4608ca" class="outline-2">
<h2 id="orgf4608ca"><span class="section-number-2">6</span> Odds and logit</h2>
<div class="outline-text-2" id="text-6">
<p>
The quantity
</p>

\begin{equation}
\frac{p(X)}{1-p(X)},
\end{equation}
<p>
is called the <i>odds</i>.
</p>

<p>
Its logarithm is called <i>log-odds</i> or simply <i>logit</i>:
</p>
\begin{equation}
\ln\left(\frac{p(X)}{1-p(X)}\right).
\end{equation}


<p>
Then, the <i>logistic</i> regression model has a <i>linear</i> logit in the variable \(X\).
</p>
</div>
</div>


<div id="outline-container-orgdbfeb65" class="outline-2">
<h2 id="orgdbfeb65"><span class="section-number-2">7</span> Estimating the Regression Coeﬃcients</h2>
<div class="outline-text-2" id="text-7">
<p>
The coefficients are estimated by the method of maximum likelihood. 
</p>

<p>
Recall
</p>

<p>
Let \(X_1, X_2, X_3, \ldots, X_n\) be a random sample from a distribution with a parameter 
\(\theta\) (In general, \(\theta\) might be a vector, \(\theta=(\theta_1,\theta_2,\ldots, \theta_k)\).) 
</p>

<p>
Suppose that \(x_1, x_2, \ldots, x_n\) are the observed values of \(X_1, X_2,\ldots , X_n\). 
</p>

<p>
We define the likelihood function as the probability of the observed sample as a function of \(\theta\):
</p>

\begin{equation}
L(x_1,\ldots, x_n ; \theta ) = P(X_1 = x_1, X_2 = x_2, \ldots, X_n = x_n; \theta )
\end{equation}

<p>
A maximum likelihood estimate of \(\theta\), is a value that maximises the likelihood function.
</p>


<p>
In the case of the logistic regression we have two vectors:
</p>
<ul class="org-ul">
<li>A vector of features \(x_i\) 's .</li>
<li>A vector of observed classes \(y_i\) 's.</li>
</ul>

<p>
And the associated probabilities:
</p>
<ul class="org-ul">
<li>A probability \(p\) of one class if \(y_i = 1\).</li>
<li>A probability \(1-p\) of the other class if \(y_i = 0\).</li>
</ul>

<p>
Then the likelihood function (in two variables) is given by
</p>

\begin{equation}
\displaystyle L(\beta_0,\beta_1) = \prod_{i=1}^{n} p(x_i)^{y_i}\left( 1- p(x_i) \right)^{1-y_i}.
\end{equation}
</div>
</div>

<div id="outline-container-orgb66a1cc" class="outline-2">
<h2 id="orgb66a1cc"><span class="section-number-2">8</span> Log likelihood for the logistic regression</h2>
<div class="outline-text-2" id="text-8">
\begin{equation}
\begin{split}
\ln(L) & = \sum_{i=1}^{n} y_i\left( \ln(p(x_i) \right) + \left(1-y_i\right)\ln\left(1 - p(x_i)\right)\\
& = \sum_{i=1}^{n}\ln\left(1 - p(x_i)\right) + \sum_{i=1}^{n} y_i \ln\left(\frac{p(x_i)}{1-p(x_i)}\right)\\
& = \sum_{i=1}^{n}\ln\left(\frac{1}{1 + e^{\beta_0 + \beta_1 x_i}}\right) + \sum_{i=1}^{n} y_i \left(\beta_0 + \beta_1 x_i\right)\\
& = - \sum_{i=1}^{n}\ln\left(1 + e^{\beta_0 + \beta_1 x_i}\right) + \sum_{i=1}^{n} y_i \left(\beta_0 + \beta_1 x_i\right).
\end{split}
\end{equation}
</div>
</div>

<div id="outline-container-org32ff803" class="outline-2">
<h2 id="org32ff803"><span class="section-number-2">9</span> Critical points</h2>
<div class="outline-text-2" id="text-9">
<p>
Then we have to solve the equations
</p>

\begin{equation}
\begin{split}
\frac{\partial \ln(L)}{\partial \beta_0} &= - \sum_{i=1}^{n} \frac{e^{\beta_0 + \beta_1 x_i}}{1 + e^{\beta_0 + \beta_1 x_i}} + \sum_{i=1}^{n} y_i \\
&= \sum_{i=1}^{n} (y_i-p(x_i) )= 0, \\
\frac{\partial \ln(L)}{\partial \beta_1} &= - \sum_{i=1}^{n} \frac{e^{\beta_0 + \beta_1 x_i}}{1 + e^{\beta_0 + \beta_1 x_i}} x_i + \sum_{i=1}^{n} y_ix_i\\
&= \sum_{i=1}^{n} (y_i-p(x_i))x_i = 0. \\
\end{split}
\end{equation}

<p>
Solutions to this system of equations are obtained using numerical methods.
</p>
</div>
</div>

<div id="outline-container-orgb02da54" class="outline-2">
<h2 id="orgb02da54"><span class="section-number-2">10</span> Multiple Logistic Regression</h2>
<div class="outline-text-2" id="text-10">
<p>
We now consider the problem of predicting a binary response using multiple
predictors. By analogy with the extension from simple to multiple linear
regression, we can generalise as follows: If \(X = (X_1, \ldots, X_p)\) are \(p\) predictor variables
then
</p>

\begin{equation}
p(X) = \frac{ e^{\beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p}}{ 1 + e^{\beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p}},
\end{equation}

<p>
since 
</p>

\begin{equation}
\ln\left(\frac{p(X)}{1-p(X)}\right)= \beta_0 + \beta_1 X_1 + \cdots + \beta_p X_p.
\end{equation}
</div>
</div>


<div id="outline-container-orgd90f6b5" class="outline-2">
<h2 id="orgd90f6b5"><span class="section-number-2">11</span> Logistic Regression with More Than Two Classes</h2>
<div class="outline-text-2" id="text-11">
<p>
If \(Y\) can take on more than two values, say \(k\) of them, we can still use logistic regression. Then each class 
\(c\) in \(0:(k-1)\), will have its own set of parameter \(\beta_0^{(c)}\) and \(\beta_1^{(c)}\), and predicted probabilities
</p>
\begin{equation}
\displaystyle \mbox{Pr}(Y = c | X = x) = \frac{e^{\beta_0^{(c)} + \beta_1^{(c)}x}}{\sum_{j=0}^{k-1} e^{\beta_0^{(j)} + \beta_1^{(j)}x}}
\end{equation}
</div>
</div>
