Lecture_notes/Lecture_8.org
* The glm in R

In R, the function =glm= is used to fit generalised linear models, specified by
     giving a symbolic description of the linear predictor 


* Summary

Let's start by recalling the last model we were trying to implement: the Logistic regression model.

+ It is a statistical technique to predict categorical outcome (binomial/multinomial) of the response variable $Y$.

+ The prediction of logistic regression is a value $p(X)$ which is
  interpreted as the probability of $Y = 1$, given certain values
  $X$. This is usually written as $P(Y=1 | X)$. Then the value of $p(X)$ is
  a number between $0$ and $1$.

+ For the independent variable $X$, we would like to adjust the
  coefficients $\beta_0$ and $\beta_1$ such that 
\[ 
p(X) = \frac{ e^{\beta_0 + \beta_1 X}}{ 1 + e^{\beta_0 + \beta_1 X}}.
\]


+ In the case of having more than one explanatory variable (Multiple
  logistic regression), then we have the log-odds
\[
\ln\left(\frac{p(X)}{1 - p(X)} \right) = \beta_0 + \beta_1 X_1 + \beta_2 X_2 + \cdots \beta_n X_n
\]


* The example in R

We started with a code to simulating the data and we are thinking in the following practical problem, given the age and gender of some patients in a hospital,
we have to create a model that decides if the patient needs a certain treatment or not, based on some records.

+ Prepare the data
+ Train the logistic model
+ Asses the predictions
+ Apply the model.

* Example (simulation)

#+begin_src R
## Y: patients need treatment "yes" "not"
## gender: 0 female 1 male
## age: ages between 18 and 80

## Sim data base
gender  <-  sample(c(0,1), size = 1000, replace=TRUE)
age  <-  round(runif(1000, 18, 80))
xb  <-  -12 + 4*gender  + 0.2*age
p  <-  exp(xb)/(1+exp(xb))
y  <- rbinom(1000,size=1,prob = p)
df  <-  data.frame(gender,age, y)
#+end_src

* The glm function

The data df will be used to train the model
First we make sure that =y= is taken as a categorical variable.

#+begin_example R
df$y  <-  as.factor(df$y)
#+end_example

Then we fit the logistic regression using the =Generalised Linear
Models= function =glm=, using the binomial family.

#+begin_example R
mylfit <- glm(y ~ gender + age, data=df, family="binomial")
#+end_example


* Null and Residual deviance.


*Null deviance*: The null deviance tells us how well we can predict our
output only using the intercept. Smaller is better.


*Residual deviance*: The residual deviance tells us how well we can
predict our output using the intercept and our inputs. Smaller is
better. The bigger the difference between the null deviance and
residual deviance is, the more helpful our input variables were for
predicting the output variable.


* Predictions

  Then we can generate our predictions
=y2= (taking a threshold of p = 0.50) and compare them with the actual
values =y=.

#+begin_example R
## Predictions
p1  <- predict(mylfit, df, type="response")
df  <-  cbind(df,p1)
df$y2  <- ifelse(df$p1 >0.5, 1, 0)
#+end_example 


* Assess the model: Confusion matrix and Accuracy

One way to asses the model, is by means of the confusion matrix.
A confusion matrix is a summary of prediction results on a classification problem.
We can also compute the accuracy of the model as the ratio of correct predictions to total predictions made.

#+begin_example R
## Predictions
## Confusion matrix
CC <- table(df$y,df$y2)

## Classification accuracy 
(CC[1,1]+CC[2,2]) / sum(CC) * 100
#+end_example



* Interpretation of the coefficients

Apply the model to the following records

#+begin_example R
data2 <- data.frame(
"Patient_ID" = c("00102", "00023", "00427"),
"age" = c(50,50,65),
"gender" = c(0,1,0))


p1  <- predict(mylfit, data2, type="response")
data2 <- cbind(data2,p1)
data2$Treatment  <- ifelse(data2$p1 >0.5, 1, 0)
data2
#+end_example


*Interpretation of the  coefficients*:

\[  \beta_0 + \beta_1 * \mbox{gender} + \beta_2 * \mbox{age} \]

Compare 

\[ e^{\beta_1} \]

with the quotient

\[
\frac{
\frac{p(x_1)}{1 - p(x_1)}
}{
\frac{p(x_0)}{1 - p(x_0)}
}
\]

where $x_1$ is a record of given age and male, and $x_0$ is a record of a female of the same age.



One can read this as: the odds of a man to need the treatment is $e^{\beta_1}$ times higher than 
the odds of a woman to need the treatment.

A similar interpretation follows for $\beta_2$.

The /intercept/ $\beta_0$ on the other hand, is not always meaningful, since in our case
is the logit of a female of age 0. 

* Intercept

Here are some graphs that may help understand the effect of the intercept

#+begin_example
B0  <- -5
XX  <-  seq(-10,10, by = 0.02)
PP  <-  exp(B0 + 2.3* XX)/(1+ exp(B0 + 2.3*XX))
plot(XX,PP)
#+end_example

In this sense, adding an intercept can help spread out the probabilities.



* Logistic regression with one explanatory variable being categorical.

If one of the explanatory variables happens to be categorical, then 
what one should do, is create a dummy variable for each of the 
different levels. 

Fortunately, =glm= does it itself:


Question: 
What if in our original simulated data set we take the /gender/ variable as categorical?
 
#+begin_example R
for(i in 1:nrow(df)){
df$NEWVAR[i]  <- sample(c("uno","dos","tres"), 1)
}

df$NEWVAR <- as.factor(df$NEWVAR)
mylfit2 <- glm(y ~ gender + age + NEWVAR, 
                      data=df, family="binomial")

summary(mylfit2)
#+end_example

* Confidence intervals

Since the logistic model is a non linear transformation, computing the confidence intervals is not as straightforward.

It may be interesting for you to read the following discussions:


[[https://stats.stackexchange.com/questions/354098/calculating-confidence-intervals-for-a-logistic-regression]]


[[https://stats.stackexchange.com/questions/5304/why-is-there-a-difference-between-manually-calculating-a-logistic-regression-95]]

#+begin_example R
confint(mylfit2)
#+end_example


* K-nearest neighbourhood

