Lecture_notes/Lecture_8.html


<div id="outline-container-orgc7c25a4" class="outline-2">
<h2 id="orgc7c25a4"><span class="section-number-2">12</span> The glm in R</h2>
<div class="outline-text-2" id="text-12">
<p>
In R, the function <code>glm</code> is used to fit generalised linear models, specified by
     giving a symbolic description of the linear predictor 
</p>
</div>
</div>


<div id="outline-container-orge1fba8e" class="outline-2">
<h2 id="orge1fba8e"><span class="section-number-2">13</span> Summary</h2>
<div class="outline-text-2" id="text-13">
<p>
Let's start by recalling the last model we were trying to implement: the Logistic regression model.
</p>

<ul class="org-ul">
<li>It is a statistical technique to predict categorical outcome (binomial/multinomial) of the response variable \(Y\).</li>

<li>The prediction of logistic regression is a value \(p(X)\) which is
interpreted as the probability of \(Y = 1\), given certain values
\(X\). This is usually written as \(P(Y=1 | X)\). Then the value of \(p(X)\) is
a number between \(0\) and \(1\).</li>

<li>For the independent variable \(X\), we would like to adjust the
coefficients \(\beta_0\) and \(\beta_1\) such that</li>
</ul>
<p>
\[ 
p(X) = \frac{ e^{\beta_0 + \beta_1 X}}{ 1 + e^{\beta_0 + \beta_1 X}}.
\]
</p>


<ul class="org-ul">
<li>In the case of having more than one explanatory variable (Multiple
logistic regression), then we have the log-odds</li>
</ul>
<p>
\[
\ln\left(\frac{p(X)}{1 - p(X)} \right) = \beta_0 + \beta_1 X_1 + \beta_2 X_2 + \cdots \beta_n X_n
\]
</p>
</div>
</div>


<div id="outline-container-orga658d83" class="outline-2">
<h2 id="orga658d83"><span class="section-number-2">14</span> The example in R</h2>
<div class="outline-text-2" id="text-14">
<p>
We started with a code to simulating the data and we are thinking in the following practical problem, given the age and gender of some patients in a hospital,
we have to create a model that decides if the patient needs a certain treatment or not, based on some records.
</p>

<ul class="org-ul">
<li>Prepare the data</li>
<li>Train the logistic model</li>
<li>Asses the predictions</li>
<li>Apply the model.</li>
</ul>
</div>
</div>

<div id="outline-container-org1252452" class="outline-2">
<h2 id="org1252452"><span class="section-number-2">15</span> Example (simulation)</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #795548;">## </span><span style="color: #795548;">Y: patients need treatment "yes" "not"</span>
<span style="color: #795548;">## </span><span style="color: #795548;">gender: 0 female 1 male</span>
<span style="color: #795548;">## </span><span style="color: #795548;">age: ages between 18 and 80</span>

<span style="color: #795548;">## </span><span style="color: #795548;">Sim data base</span>
gender  <span style="color: #0288D1;">&lt;-</span>  sample(c(0,1), size = 1000, replace=<span style="color: #3f51b5;">TRUE</span>)
age  <span style="color: #0288D1;">&lt;-</span>  round(runif(1000, 18, 80))
xb  <span style="color: #0288D1;">&lt;-</span>  -12 + 4*gender  + 0.2*age
p  <span style="color: #0288D1;">&lt;-</span>  exp(xb)/(1+exp(xb))
y  <span style="color: #0288D1;">&lt;-</span> rbinom(1000,size=1,prob = p)
df  <span style="color: #0288D1;">&lt;-</span>  data.frame(gender,age, y)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4958166" class="outline-2">
<h2 id="org4958166"><span class="section-number-2">16</span> The glm function</h2>
<div class="outline-text-2" id="text-16">
<p>
The data df will be used to train the model
First we make sure that <code>y</code> is taken as a categorical variable.
</p>

<pre class="example">
df$y  &lt;-  as.factor(df$y)
</pre>

<p>
Then we fit the logistic regression using the <code>Generalised Linear
Models</code> function <code>glm</code>, using the binomial family.
</p>

<pre class="example">
mylfit &lt;- glm(y ~ gender + age, data=df, family="binomial")
</pre>
</div>
</div>


<div id="outline-container-org32e19af" class="outline-2">
<h2 id="org32e19af"><span class="section-number-2">17</span> Null and Residual deviance.</h2>
<div class="outline-text-2" id="text-17">
<p>
<b>Null deviance</b>: The null deviance tells us how well we can predict our
output only using the intercept. Smaller is better.
</p>


<p>
<b>Residual deviance</b>: The residual deviance tells us how well we can
predict our output using the intercept and our inputs. Smaller is
better. The bigger the difference between the null deviance and
residual deviance is, the more helpful our input variables were for
predicting the output variable.
</p>
</div>
</div>


<div id="outline-container-org74e1614" class="outline-2">
<h2 id="org74e1614"><span class="section-number-2">18</span> Predictions</h2>
<div class="outline-text-2" id="text-18">
<p>
  Then we can generate our predictions
<code>y2</code> (taking a threshold of p = 0.50) and compare them with the actual
values <code>y</code>.
</p>

<pre class="example">
## Predictions
p1  &lt;- predict(mylfit, df, type="response")
df  &lt;-  cbind(df,p1)
df$y2  &lt;- ifelse(df$p1 &gt;0.5, 1, 0)
</pre>
</div>
</div>


<div id="outline-container-org9b636fc" class="outline-2">
<h2 id="org9b636fc"><span class="section-number-2">19</span> Assess the model: Confusion matrix and Accuracy</h2>
<div class="outline-text-2" id="text-19">
<p>
One way to asses the model, is by means of the confusion matrix.
A confusion matrix is a summary of prediction results on a classification problem.
We can also compute the accuracy of the model as the ratio of correct predictions to total predictions made.
</p>

<pre class="example">
## Predictions
## Confusion matrix
CC &lt;- table(df$y,df$y2)

## Classification accuracy 
(CC[1,1]+CC[2,2]) / sum(CC) * 100
</pre>
</div>
</div>



<div id="outline-container-org6db8e69" class="outline-2">
<h2 id="org6db8e69"><span class="section-number-2">20</span> Interpretation of the coefficients</h2>
<div class="outline-text-2" id="text-20">
<p>
Apply the model to the following records
</p>

<pre class="example">
data2 &lt;- data.frame(
"Patient_ID" = c("00102", "00023", "00427"),
"age" = c(50,50,65),
"gender" = c(0,1,0))


p1  &lt;- predict(mylfit, data2, type="response")
data2 &lt;- cbind(data2,p1)
data2$Treatment  &lt;- ifelse(data2$p1 &gt;0.5, 1, 0)
data2
</pre>


<p>
<b>Interpretation of the  coefficients</b>:
</p>

<p>
\[  \beta_0 + \beta_1 * \mbox{gender} + \beta_2 * \mbox{age} \]
</p>

<p>
Compare 
</p>

<p>
\[ e^{\beta_1} \]
</p>

<p>
with the quotient
</p>

<p>
\[
\frac{
\frac{p(x_1)}{1 - p(x_1)}
}{
\frac{p(x_0)}{1 - p(x_0)}
}
\]
</p>

<p>
where \(x_1\) is a record of given age and male, and \(x_0\) is a record of a female of the same age.
</p>



<p>
One can read this as: the odds of a man to need the treatment is \(e^{\beta_1}\) times higher than 
the odds of a woman to need the treatment.
</p>

<p>
A similar interpretation follows for \(\beta_2\).
</p>

<p>
The <i>intercept</i> \(\beta_0\) on the other hand, is not always meaningful, since in our case
is the logit of a female of age 0. 
</p>
</div>
</div>

<div id="outline-container-org8296cb2" class="outline-2">
<h2 id="org8296cb2"><span class="section-number-2">21</span> Intercept</h2>
<div class="outline-text-2" id="text-21">
<p>
Here are some graphs that may help understand the effect of the intercept
</p>

<pre class="example">
B0  &lt;- -5
XX  &lt;-  seq(-10,10, by = 0.02)
PP  &lt;-  exp(B0 + 2.3* XX)/(1+ exp(B0 + 2.3*XX))
plot(XX,PP)
</pre>

<p>
In this sense, adding an intercept can help spread out the probabilities.
</p>
</div>
</div>



<div id="outline-container-orgf8f8cd0" class="outline-2">
<h2 id="orgf8f8cd0"><span class="section-number-2">22</span> Logistic regression with one explanatory variable being categorical.</h2>
<div class="outline-text-2" id="text-22">
<p>
If one of the explanatory variables happens to be categorical, then 
what one should do, is create a dummy variable for each of the 
different levels. 
</p>

<p>
Fortunately, <code>glm</code> does it itself:
</p>


<p>
Question: 
What if in our original simulated data set we take the <i>gender</i> variable as categorical?
</p>

<pre class="example">
for(i in 1:nrow(df)){
df$NEWVAR[i]  &lt;- sample(c("uno","dos","tres"), 1)
}

df$NEWVAR &lt;- as.factor(df$NEWVAR)
mylfit2 &lt;- glm(y ~ gender + age + NEWVAR, 
                      data=df, family="binomial")

summary(mylfit2)
</pre>
</div>
</div>

<div id="outline-container-org86e3b59" class="outline-2">
<h2 id="org86e3b59"><span class="section-number-2">23</span> Confidence intervals</h2>
<div class="outline-text-2" id="text-23">
<p>
Since the logistic model is a non linear transformation, computing the confidence intervals is not as straightforward.
</p>

<p>
It may be interesting for you to read the following discussions:
</p>


<p>
<a href="https://stats.stackexchange.com/questions/354098/calculating-confidence-intervals-for-a-logistic-regression">https://stats.stackexchange.com/questions/354098/calculating-confidence-intervals-for-a-logistic-regression</a>
</p>


<p>
<a href="https://stats.stackexchange.com/questions/5304/why-is-there-a-difference-between-manually-calculating-a-logistic-regression-95">https://stats.stackexchange.com/questions/5304/why-is-there-a-difference-between-manually-calculating-a-logistic-regression-95</a>
</p>

<pre class="example">
confint(mylfit2)
</pre>
</div>
</div>
