Lecture_notes/Lecture_8.org
** Logistic Regression for more than two Response Classes

The two-class logistic regression models discussed in the previous sections have multiple-class
extensions, but in practice they tend not to be used all that often. 
One of the reasons is that the method of discriminant analysis, is popular for multiple-class classiﬁcation.
Here some other examples of methods to tackle the problem of classification you may find in the literature:

+ Logistic regression.
+ Linear discriminant analysis.
+ K-nearest neighbours.


Here we won't go into the details of k-nearest neighbourhood algorithm, the goal is to have an informal 
discussion and see its implementation

The following picture explain's the fundamentals

https://miro.medium.com/max/720/0*34SajbTO2C5Lvigs.webp

** Normalisation function

Different variables have different scaling units, like weight in kg
and height in cm. We normalise each one of the variables using the
formula (x-min(x))/(max(x) — min(x)) that we will also see in the
examples below. Now if you have one variable of 200kg and another with
50kg, after normalisation both will be represented by the value
between 0 and 1.

** Example: Iris.

#+begin_example R

## We will be working with the iris data set.
df <- iris
head(df)

nor <-function(x) { (x -min(x))/(max(x)-min(x))   }
 
##Run normalisation on first 4 columns of dataset 
## because they are the predictors.
## Note the use of the lapply function

df_norm <- as.data.frame(lapply(df[,c(1:4)], nor))
 
summary(df_norm)

##extract testing set consisting of a 
## subset of 90% of the rows

ran <- sample(1:nrow(df), 0.9 * nrow(df)) 
df_train <- df_norm[ran,] 
df_train_category <- df[ran,5] 


df_test <- df_norm[-ran,]  
df_test_category <- df[-ran,5]


##load the package class
 library(class) 
##run knn function
 pr <- knn(df_train,df_test,cl=df_train_category,k=5)
 
 ##create confusion matrix
CC <- table(pr,df_test_category)
 
## accuracy is the ratio of  correct predictions 
## by total number of predictions 
 
 accuracy <- function(x){
                  sum(diag(x)/(sum(x,na.rm=TRUE))) * 100
		  }
 accuracy(CC)
#+end_example
