Lecture_notes/Lecture_8.html


<div id="outline-container-org662f880" class="outline-2">
<h2 id="org662f880"><span class="section-number-2">24</span> K-nearest neighbourhood</h2>
<div class="outline-text-2" id="text-24">
</div>
<div id="outline-container-org2a7b79f" class="outline-3">
<h3 id="org2a7b79f"><span class="section-number-3">24.1</span> Logistic Regression for more than two Response Classes</h3>
<div class="outline-text-3" id="text-24-1">
<p>
The two-class logistic regression models discussed in the previous sections have multiple-class
extensions, but in practice they tend not to be used all that often. 
One of the reasons is that the method of discriminant analysis, is popular for multiple-class classiﬁcation.
Here some other examples of methods to tackle the problem of classification you may find in the literature:
</p>

<ul class="org-ul">
<li>Logistic regression.</li>
<li>Linear discriminant analysis.</li>
<li>K-nearest neighbours.</li>
</ul>


<p>
Here we won't go into the details of k-nearest neighbourhood algorithm, the goal is to have an informal 
discussion and see its implementation
</p>

<p>
The following picture explain's the fundamentals
</p>

<p>
<a href="https://miro.medium.com/max/720/0*34SajbTO2C5Lvigs.webp">https://miro.medium.com/max/720/0*34SajbTO2C5Lvigs.webp</a>
</p>
</div>
</div>

<div id="outline-container-orge8adacd" class="outline-3">
<h3 id="orge8adacd"><span class="section-number-3">24.2</span> Normalisation function</h3>
<div class="outline-text-3" id="text-24-2">
<p>
Different variables have different scaling units, like weight in kg
and height in cm. We normalise each one of the variables using the
formula (x-min(x))/(max(x) — min(x)) that we will also see in the
examples below. Now if you have one variable of 200kg and another with
50kg, after normalisation both will be represented by the value
between 0 and 1.
</p>
</div>
</div>

<div id="outline-container-orgda6f8c5" class="outline-3">
<h3 id="orgda6f8c5"><span class="section-number-3">24.3</span> Example: Iris.</h3>
<div class="outline-text-3" id="text-24-3">
<pre class="example">

## We will be working with the iris data set.
df &lt;- iris
head(df)

nor &lt;-function(x) { (x -min(x))/(max(x)-min(x))   }
 
##Run normalisation on first 4 columns of dataset 
## because they are the predictors.
## Note the use of the lapply function

df_norm &lt;- as.data.frame(lapply(df[,c(1:4)], nor))
 
summary(df_norm)

##extract testing set consisting of a 
## subset of 90% of the rows

ran &lt;- sample(1:nrow(df), 0.9 * nrow(df)) 
df_train &lt;- df_norm[ran,] 
df_train_category &lt;- df[ran,5] 


df_test &lt;- df_norm[-ran,]  
df_test_category &lt;- df[-ran,5]


##load the package class
 library(class) 
##run knn function
 pr &lt;- knn(df_train,df_test,cl=df_train_category,k=5)
 
 ##create confusion matrix
CC &lt;- table(pr,df_test_category)
 
## accuracy is the ratio of  correct predictions 
## by total number of predictions 
 
 accuracy &lt;- function(x){
                  sum(diag(x)/(sum(x,na.rm=TRUE))) * 100
		  }
 accuracy(CC)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros-Chávez</p>
<p class="date">Created: 2023-01-11 Wed 15:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
